
## Plan Result (oidc)

[CI link](https://github.com/nangashi/dcr/actions/runs/7188734644)


<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * aws_iam_role.administrator
  * aws_iam_role_policy_attachment.administrator
* Update
  * aws_iam_role.read_only


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_role.administrator will be created
  + resource "aws_iam_role" "administrator" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:sub" = "repo:nanigashi/dcr:environment:production"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::384081048358:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM Role for GitHub Actions OIDC"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "AdministratorOidc-prd"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.read_only will be updated in-place
  ~ resource "aws_iam_role" "read_only" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringEquals = {
                              ~ "token.actions.githubusercontent.com:sub" = "repo:nangashi/dcr:environment:development" -> "repo:nanigashi/dcr:environment:development"
                            }
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "ReadOnlyOidc-prd"
        name                  = "ReadOnlyOidc-prd"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.administrator will be created
  + resource "aws_iam_role_policy_attachment" "administrator" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "AdministratorOidc-prd"
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"build","PRNumber":25,"Program":"tfcmt","SHA1":"4b9eec2ddda3abcf19fa274ae5d1bef7a21a52eb","Target":"oidc","Vars":{},"WorkflowName":"terraform docs"} -->